ErpTest/src/Catalogs/ItobСтатусыОбъектов/ItobСтатусыОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ItobСтатусыОбъектов</name>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветФона</name>
    <comment>B*256*256 + G*256 + R</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветНадписи</name>
    <comment>B*256*256 + G*256 + R</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>УсловияОтбора</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ItobНазначенияДатчиков</types>
        <types>EnumRef.ItobПоказательКоординат</types>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидСравнения</name>
      <type>
        <types>EnumRef.ItobВидыСравнения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>EnumRef.ItobСостоянияТерминалов</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ErpTest/src/Enums/ItobПоказательКоординат/ItobПоказательКоординат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ItobПоказательКоординат</name>
  <enumValues>
    <name>Скорость</name>
  </enumValues>
  <enumValues>
    <name>Направление</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/Catalogs/ItobСтатусыОбъектов/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

// Процедура - обработчик события "ПриОткрытии".
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ItobОбщегоНазначенияКлиент.УстановитьВидимостьСтатусыОбъектов(ЭтотОбъект);
КонецПроцедуры

// Процедура - обработчик события "ПриСозданииНаСервере".
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ = Неопределено Или Параметры.Ключ.Пустая() Тогда
		// Создание нового объекта
		
		Объект.ЦветФона = ItobОбщегоНазначенияКлиентСервер.ПолучитьЗначениеХраненияЦвета(255,255,255);				
	
	КонецЕсли;
	
	ЭтаФорма.Элементы.УсловияОтбораПоказатель.СписокВыбора.Очистить();
	ЭтаФорма.Элементы.УсловияОтбораПоказатель.СписокВыбора.Добавить("Состояние");
	ЭтаФорма.Элементы.УсловияОтбораПоказатель.СписокВыбора.Добавить
	       ("ОтсутствуютДанныеМинуты", НСтр("ru = 'Отсутствуют данные, минуты'"));
	ЭтаФорма.Элементы.УсловияОтбораПоказатель.СписокВыбора.Добавить
	           ("ОтсутствуютДанныеЧасы", НСтр("ru = 'Отсутствуют данные, часы'"));
	ЭтаФорма.Элементы.УсловияОтбораПоказатель.СписокВыбора.Добавить
	                 (Перечисления.ItobПоказательКоординат.Скорость);
	ЭтаФорма.Элементы.УсловияОтбораПоказатель.СписокВыбора.Добавить
	              (Перечисления.ItobПоказательКоординат.Направление);
			
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ItobНазначенияДатчиков.Ссылка,
	               |	ItobНазначенияДатчиков.Представление КАК Представление
	               |ИЗ
	               |	Справочник.ItobНазначенияДатчиков КАК ItobНазначенияДатчиков
	               |ГДЕ
	               |	(НЕ ItobНазначенияДатчиков.ПометкаУдаления)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Представление";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЭтаФорма.Элементы.УсловияОтбораПоказатель.СписокВыбора.Добавить(Выборка.Ссылка, Выборка.Представление);
	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Процедура - обработчик команды "ВыбратьЦвет".
//
&НаКлиенте
Процедура ВыбратьЦветФона(Команда)
	ДиалогВыбораЦвета = Новый ДиалогВыбораЦвета;
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ПодчиненныйОбъект", "ЦветФона");
	ДопПараметры.Вставить("ЭтотОбъект", ЭтотОбъект);
	ДиалогВыбораЦвета.Показать(Новый ОписаниеОповещения("ООВыбратьЦвет", ItobОбщегоНазначенияКлиент, ДопПараметры));
КонецПроцедуры

// Процедура - обработчик команды "ВыбратьЦветНадписи".
//
&НаКлиенте
Процедура ВыбратьЦветНадписи(Команда)
	ДиалогВыбораЦвета = Новый ДиалогВыбораЦвета;
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ПодчиненныйОбъект", "ЦветНадписи");
	ДопПараметры.Вставить("ЭтотОбъект", ЭтотОбъект);
	ДопПараметры.Вставить("тУстановитьКартинку", Ложь);
	ДиалогВыбораЦвета.Показать(Новый ОписаниеОповещения("ООВыбратьЦвет", ItobОбщегоНазначенияКлиент, ДопПараметры));
КонецПроцедуры

#КонецОбласти
 
#Область СлужебныеПроцедурыИФункции

// Процедура - обработчик события "УсловияОтбораПоказательОбработкаВыбора".
//
&НаКлиенте
Процедура УсловияОтбораПоказательОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Строка") И ВыбранноеЗначение = "Состояние" Тогда
		Если ТипЗнч(Элементы.УсловияОтбора.ТекущиеДанные.Значение) <> Тип("ПеречислениеСсылка.ItobСостоянияТерминалов") Тогда
			Элементы.УсловияОтбора.ТекущиеДанные.Значение = ПустоеСостояниеТерминала;				
			
		КонецЕсли;		
		
	Иначе
		Если ТипЗнч(Элементы.УсловияОтбора.ТекущиеДанные.Значение) <> Тип("Число") Тогда
			Элементы.УсловияОтбора.ТекущиеДанные.Значение = 0;			
		
		КонецЕсли;		
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
